package ru.alternation.Simple.section3.stage3.step12;

/**
 На игровом поле находится робот. Позиция робота на поле описывается двумя целочисленным координатами: X и Y.
 Ось X смотрит слева направо, ось Y — снизу вверх. (Помните, как рисовали графики функций в школе?)

 В начальный момент робот находится в некоторой позиции на поле.
 Также известно, куда робот смотрит: вверх, вниз, направо или налево.
 Ваша задача — привести робота в заданную точку игрового поля.

 Робот описывается классом Robot. Вы можете пользоваться следующими его методами (реализация вам неизвестна):


 ...


 */
public class Main {

    public static void main(String[] args) {

    }

}
