package ru.alternation.Simple.section6.stage2.step15;

/**
 Напишите программу, которая прочитает из System.in последовательность целых чисел, разделенных пробелами,
 затем удалит из них все числа, стоящие на четных позициях, и затем выведет получившуюся последовательность в
 обратном порядке в System.out.

 Все числа влезают в int. Позиции чисел в последовательности нумеруются с нуля.

 В этом задании надо написать программу целиком, включая import'ы, декларацию класса Main и метода main.

 ______________________
 Sample Input:
 1 2 3 4 5 6 7

 Sample Output:
 6 4 2

 */
public class Main {
    public static void main(String[] args) {

    }
}
